Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetModifiedElementIds(Autodesk.Revit.DB.ElementFilter)
Returns set of elements  that were modified according to the given element filter.
filter:
The element filter to be applied.
Returns:
The set of ElementId for modified elements that pass the filter.
Returns empty set if no elements are found which pass the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetAddedElementIds(Autodesk.Revit.DB.ElementFilter)
Returns set of newly added elements that pass the filter.
filter:
The element filter to be applied.
Returns:
The set of ElementId for newly added elements that pass the filter.
Returns empty set if no elements are found which pass the filter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014